[
  {
    "id": "xp4dpg",
    "title": "Public Relations Consultant for Sustainable Infrastructure Company",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Public Relations Strategy"
    ],
    "description": "Overview:\nWe're a global leader in sustainable infrastructure that is looking for a strategic PR consultant to lead the strategic communications for a major acquisition. \n\nWe need a though partner who understands the nuances of the Digital Out-of-Home (DOOH) and Ad-Tech landscape to position our newly expanded network as the most innovated, data-driven player in North America.\n\n\nAd-Tech Specialist: Deep experience in digital advertising, DOOH, or media technology.\nMedia Access: Existing, active relationships with editors at Adweek, AdAge, The Drum, Digiday, and other tier-one trades.\nProven Results: A track record of securing earned media for brands in the advertising space within the last 12 months.\nStrategic Vision: Ability to act as a consultant—not just a publicist—to craft a \"Phase 2\" narrative that positions the brand as a data-driven innovator.",
    "location": "",
    "time_posted": "an hour",
    "status": "New Project",
    "detected_at": "2026-01-05 23:08:30"
  },
  {
    "id": "xe9kem",
    "title": "Director, Digital Marketing & Integration Leader",
    "categories": [
      "Sales & Marketing",
      "Digital Marketing",
      "Digital Marketing Project Management"
    ],
    "description": "Overview:\nWe are seeking a strategic and results-driven Sr. Principal of Digital Marketing & Integration Leade to lead the integration and harmonization of our digital marketing practices across the enterprise. This role is pivotal in shaping our overall digital presence, driving customer engagement, and ensuring a seamless brand and operational integration across diverse platforms, teams, and processes.\n\nThe Digital Marketing and Integration Leader will be responsible for helping to shape the future of the digital experience for our global organization. They will be tasked with analyzing, planning, and executing on high-impact, cross-functional initiatives that will transform our primary web properties and other key digital touchpoints.\nThe ideal candidate will be someone who thrives in ambiguity and possesses the high-level expertise required to operate independently within a complex corporate environment.\n\n\nDevelop and execute a comprehensive digital marketing integration strategy aligned with business goals and customer needs.\nLead digital campaigns integration across web, email, SEO/SEM, social media, and paid media to drive awareness, engagement, and conversion.\nCollaborate with product marketing, sales, and scientific teams to ensure consistent messaging and positioning.\nManage initiative level digital marketing budget and agency/vendor relationships.\nServe as the marketing lead for the integration of two companies, ensuring alignment of digital assets, brand identity, and customer experience.\nDevelop and manage integration plans for digital platforms, including websites, CRM systems, marketing automation, and analytics tools.\nPartner with cross-functional teams (IT, HR, Sales, Legal, etc.) to ensure smooth operational and cultural integration.\nLead change management and communication strategies to support internal and external stakeholders.\nBuild and mentor a high-performing digital marketing team.\nSet clear goals, KPIs, and performance metrics for team members and campaigns.\n\nBachelor’s degree in Marketing, Communications, or related field; MBA or advanced degree preferred.\n10+ years of experience in digital marketing, with at least 5 years in a leadership role.\nProven experience in managing digital transformation or integration projects, ideally in the life sciences or healthcare industry.\nStrong understanding of digital marketing tools, platforms, and analytics.\nExcellent leadership, communication, and project management skills.\nAbility to thrive in a fast-paced, dynamic environment with multiple stakeholders.",
    "location": "Boston, MA, USA",
    "time_posted": "an hour",
    "status": "New Project",
    "detected_at": "2026-01-05 23:08:30"
  },
  {
    "id": "yndjvv",
    "title": "Pricing Expert for a Testing, Inspection and Certification business",
    "categories": [
      "Market Research",
      "General Market Research",
      "Pricing Analysis & Optimization"
    ],
    "description": "CONTEXT:  The client is a major trade association which sets industry safety and operational standards for their members and those members' suppliers.  It has a small ($120m revenue) TIC business as part of their overall business model.  It comprises of five different lines of business, including (1) Standards, (2) Certification services, (3) Individual certification programs; (4) Training; (5) Quality assurance for one of the industry's widely sold products.\n\nPROBLEM:  Currently the client charges their customer base in a very rudimentary basis.  For example, the price for technical standards is set based on the number of pages.  The client believes they can shift toward more \"value based pricing\" given how important their standards and certifications are totheir client base (eg. they form the basis for the clients' \"license to operate\" in the industry).  That said, the client is also aware that they cannot be \"too greedy\" because the overall trade association has a mission to promote safety and operational excellence in the members' industry, and thus disseminating these standards and certifications widely is part of the mission.  So, this tension between maximizing revenue from \"value based pricing\" and the non-profit mission of promoting safety should be respected and dealt with in a thoughtful manner. \n\nSCOPE:  Unclear right now, because we need this Pricing expert to help engage with the client and articulate what kind of scope this project would need to have in order to answer the client's question. \nEXPET QUALS:  Seeking a Pricing expert who is steeped in \"value based pricing\" approaches, ideally with experience in the TIC (testing, inspection, certification) space.  They would need to engage senior client executives credibly, with plenty of \"war stories\" and approaches that have worked well and produced tangible results with prior clients.  They would need to be able to scope the initial engagement, likely starting with one of the five lines of business as a proof of concept project, before moving on to the others.  They also need to be able to lead this work, supported by a team of consultants (likely generalist ex-MBB problem solvers).  If any particular analytical tools are required, they need to be able to help bring those into the project.",
    "location": "",
    "time_posted": "2 hours",
    "status": "New Project",
    "detected_at": "2026-01-05 23:08:30"
  },
  {
    "id": "x82e52",
    "title": "Commercial Diligence – Future of Warehouse Automation & Labor Impact",
    "categories": [
      "Market Research",
      "General Market Research",
      "General Market Research Expertise"
    ],
    "description": "As part of your pitch, please copy/paste the \"Ideal Candidate Profile\" bullets for the role and briefly reply with your relevant qualifications for each one.\n\n \nA leading Private Equity firm is preparing for the sale of a portfolio company that provides outsourced skilled labor and managed services for warehouses and distribution centers. Potential buyers have expressed concern that rapid advancements in warehouse automation may render the company's labor-centric business model obsolete in the medium-to-long term.\n\nThe client requires a to develop a credible, forward-looking report assessing the relationship between warehouse automation and skilled labor. The goal is to validate the thesis that automation will evolve—rather than replace—the need for a skilled human workforce in this specific value chain.\n\n\nStrategic Assessment: Analyze the current and future state of warehouse automation (3, 5, and 10-year horizon).\nImpact Analysis: Specifically address how automation trends affect the demand for third-party skilled labor in distribution centers.\nFinal Deliverable: Produce a comprehensive \"White Paper\" or Presentation Deck that will serve as a companion piece to the Confidential Information Memorandum (CIM). This document must provide a definitive, expert viewpoint that validates the longevity of the labor-based business model.\n\nSeniority: Former C-Suite, President, or SVP-level executive.\nIndustry Experience: Deep operational experience within the Warehousing, Logistics, or Distribution Center value chain.\nSpecific Expertise: Strong command of automation technologies and their practical implementation in logistics environments.\nCredibility: \"Blue Chip\" resume that provides immediate credibility to institutional investors and buyers.\nCapabilities: Ability to drive intellectual content and narrative. (Note: The client can provide internal support for data crunching and basic slide design if the expert operates independently, though small teams are also welcome).",
    "location": "",
    "time_posted": "2 days",
    "status": "New Project",
    "detected_at": "2026-01-05 23:08:30"
  },
  {
    "id": "rdnvw6",
    "title": "Strategic IT Integration Lead: Global vs. Regional Operating Model (International Sportswear Retail)",
    "categories": [
      "Corporate Strategy",
      "Mergers & Acquisitions",
      "Post-Merger Integration"
    ],
    "description": "Project Overview:\nWe are seeking an expert IT M&A Strategy Consultant to lead the development of a technology integration framework following a high-profile, of a major US-based athletic footwear and fashion retailer by a leading .\nThe goal of this engagement is to define a clear . You will determine which parts of the technology stack should be centralized under the global parent’s infrastructure (e.g., Global Order Management, ERP) and which should remain regional or entity-specific to maintain the US brand's \"best-in-class\" local performance. You will serve as a strategic advisor to the , providing the framework and \"hand-holding\" necessary to navigate this transatlantic integration.\n\n\nDevelop the decision-making matrix to categorize IT services and systems into Global, Regional, or Local \"buckets.\"\nEvaluate the newly acquired US entity’s \"best-in-class\" e-commerce and omnichannel platforms against the global parent’s existing ecosystem to identify synergies, redundancies, or retention needs.\nCreate a roadmap for aligning US technical operations with the parent company's global standards without disrupting the brand's local market advantage.\nBridge communications between the UK corporate headquarters and the US-based leadership team to ensure technical alignment and cultural buy-in.\n\nDeep experience in high-volume retail, specifically in the sectors, where omnichannel and inventory velocity are critical.\nProven track record of leading IT integrations for large-scale acquisitions (ideally involving UK and US entities).\nSkilled in design and application rationalization.\nExperience advising C-suite leaders (CTOs/CIOs) through complex, urgent transformations.",
    "location": "",
    "time_posted": "13 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 09:37:20"
  }
]