[
  {
    "id": "y4qk7m",
    "title": "Data Driven Transformation of Global Pro Services Co",
    "categories": [
      "Data & Business Analytics",
      "Big Data & Analytics",
      "Data Science & Analysis"
    ],
    "description": "A global leader in technology talent services is undergoing a transformation in which it needs to transform its data infrastructure, systems, and operations to be more strategically aligned to customers. Think of the shift from being a reactive vendor who services talent needs to a proactive market-maker who seeks out its most strategic partners. \n\nThey are seeking an experienced data strategist and architect to support a ~3 month engagement focused on data discovery across ~100K job requisitions and 1 million+ talent profiles and helping to devise a \"talent exchange\" that provides dynamic data for leaders to steer the business. \n\n\nConduct data discovery and cleaning to classify both talent and demand at scale.\nHelp design and validate a standardized scoring rubric to evaluate opportunities based on multiple factors.\nDefine a common data language that enables clearer understanding of workforce supply/demand dynamics.\nSupport the development of a data-driven recommendation engine that pulls live information (e.g., via Salesforce CRM).\nConfirm and refine the current draft architecture (already ~85% complete) and advise on polishing it into a scalable, always-on system.\n\nData Discovery & Cleaning: Assess existing job and talent data, identify leakage, and prepare it for AI-driven classification.\nArchitecture & Rules Development: Build frameworks to classify demand and talent, set scoring rules, and define data inputs/outputs.\nRecommendation Engine Validation: Vet the design of the recommendation system, including its data architecture and specificity requirements.\n\nDeep experience ins.\nSkilled at identifying relationships between complex datasets \nStrong familiarity with BI and visualization tools (Looker preferred; Tableau/Power BI also relevant).\nComfortable with Salesforce data integrations.\nBackground in consulting or advanced data strategy roles preferred (prior MBB experience preferred, though not required).\nAdvanced beyond spreadsheet-level analysis; has handled large-scale, high-complexity datasets.\n\nStart date: ASAP\nDuration: Approx. 3 months (potential for extension).\nStructure: Deliverable-based / fixed cost (not hourly)\nRemote role",
    "location": "$80,000",
    "time_posted": "19 minutes",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "rdnvw6",
    "title": "Strategic IT Integration Lead: Global vs. Regional Operating Model (International Sportswear Retail)",
    "categories": [
      "Corporate Strategy",
      "Mergers & Acquisitions",
      "Post-Merger Integration"
    ],
    "description": "Project Overview:\nWe are seeking an expert IT M&A Strategy Consultant to lead the development of a technology integration framework following a high-profile, of a major US-based athletic footwear and fashion retailer by a leading .\nThe goal of this engagement is to define a clear . You will determine which parts of the technology stack should be centralized under the global parent’s infrastructure (e.g., Global Order Management, ERP) and which should remain regional or entity-specific to maintain the US brand's \"best-in-class\" local performance. You will serve as a strategic advisor to the , providing the framework and \"hand-holding\" necessary to navigate this transatlantic integration.\n\n\nDevelop the decision-making matrix to categorize IT services and systems into Global, Regional, or Local \"buckets.\"\nEvaluate the newly acquired US entity’s \"best-in-class\" e-commerce and omnichannel platforms against the global parent’s existing ecosystem to identify synergies, redundancies, or retention needs.\nCreate a roadmap for aligning US technical operations with the parent company's global standards without disrupting the brand's local market advantage.\nBridge communications between the UK corporate headquarters and the US-based leadership team to ensure technical alignment and cultural buy-in.\n\nDeep experience in high-volume retail, specifically in the sectors, where omnichannel and inventory velocity are critical.\nProven track record of leading IT integrations for large-scale acquisitions (ideally involving UK and US entities).\nSkilled in design and application rationalization.\nExperience advising C-suite leaders (CTOs/CIOs) through complex, urgent transformations.",
    "location": "",
    "time_posted": "18 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "xp4dpg",
    "title": "Public Relations Consultant for Sustainable Infrastructure Company",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Public Relations Strategy"
    ],
    "description": "Overview:\nWe're a global leader in sustainable infrastructure that is looking for a strategic PR consultant to lead the strategic communications for a major acquisition. \n\nWe need a though partner who understands the nuances of the Digital Out-of-Home (DOOH) and Ad-Tech landscape to position our newly expanded network as the most innovated, data-driven player in North America.\n\n\nAd-Tech Specialist: Deep experience in digital advertising, DOOH, or media technology.\nMedia Access: Existing, active relationships with editors at Adweek, AdAge, The Drum, Digiday, and other tier-one trades.\nProven Results: A track record of securing earned media for brands in the advertising space within the last 12 months.\nStrategic Vision: Ability to act as a consultant—not just a publicist—to craft a \"Phase 2\" narrative that positions the brand as a data-driven innovator.",
    "location": "",
    "time_posted": "21 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "xe9kem",
    "title": "Director, Digital Marketing & Integration Leader",
    "categories": [
      "Sales & Marketing",
      "Digital Marketing",
      "Digital Marketing Project Management"
    ],
    "description": "Overview:\nWe are seeking a strategic and results-driven Sr. Principal of Digital Marketing & Integration Leade to lead the integration and harmonization of our digital marketing practices across the enterprise. This role is pivotal in shaping our overall digital presence, driving customer engagement, and ensuring a seamless brand and operational integration across diverse platforms, teams, and processes.\n\nThe Digital Marketing and Integration Leader will be responsible for helping to shape the future of the digital experience for our global organization. They will be tasked with analyzing, planning, and executing on high-impact, cross-functional initiatives that will transform our primary web properties and other key digital touchpoints.\nThe ideal candidate will be someone who thrives in ambiguity and possesses the high-level expertise required to operate independently within a complex corporate environment.\n\n\nDevelop and execute a comprehensive digital marketing integration strategy aligned with business goals and customer needs.\nLead digital campaigns integration across web, email, SEO/SEM, social media, and paid media to drive awareness, engagement, and conversion.\nCollaborate with product marketing, sales, and scientific teams to ensure consistent messaging and positioning.\nManage initiative level digital marketing budget and agency/vendor relationships.\nServe as the marketing lead for the integration of two companies, ensuring alignment of digital assets, brand identity, and customer experience.\nDevelop and manage integration plans for digital platforms, including websites, CRM systems, marketing automation, and analytics tools.\nPartner with cross-functional teams (IT, HR, Sales, Legal, etc.) to ensure smooth operational and cultural integration.\nLead change management and communication strategies to support internal and external stakeholders.\nBuild and mentor a high-performing digital marketing team.\nSet clear goals, KPIs, and performance metrics for team members and campaigns.\n\nBachelor’s degree in Marketing, Communications, or related field; MBA or advanced degree preferred.\n10+ years of experience in digital marketing, with at least 5 years in a leadership role.\nProven experience in managing digital transformation or integration projects, ideally in the life sciences or healthcare industry.\nStrong understanding of digital marketing tools, platforms, and analytics.\nExcellent leadership, communication, and project management skills.\nAbility to thrive in a fast-paced, dynamic environment with multiple stakeholders.",
    "location": "Boston, MA, USA",
    "time_posted": "22 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "x3wvjq",
    "title": "Sr. Consultant for Diligence in Towers and Wireless Industry",
    "categories": [
      "Market Research",
      "General Market Research",
      "General Market Research Expertise"
    ],
    "description": "**In your pitch** Please copy and paste the Ideal Candidate bullets to respond with your specific experiences, providing specific examples of previous diligence you have worked on\n\nWe are a consulting firm that is looking for a senior consultant to assist our team on a Towers and Wireless diligence projects. Prior experience with market overview, market analysis, business plan assessment, market forecasts. Strong excel and communication skills desired.\n\nThis specific project will last 4 weeks and will start as soon as possible.\n\nWhile this is one project, we typically have multiple similar diligence engagements that we are also looking for Data Center, Fiber, Towers, and general TMT experience.\n\n\nFormer Management Consultant with Diligence experience\nExperience with TMT Industry\nExperience with Towers and/or Wireless",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-06 23:37:00"
  },
  {
    "id": "xq48mb",
    "title": "Engineered wire harness data center product strategy",
    "categories": [
      "Digital Transformation & Technology",
      "Digital Strategy & Transformation",
      "Product Management"
    ],
    "description": "A custom fabricator of wire harness assemblies is looking to break into the data center market through the electrical contractor channel.  They would like to collect intelligence on the appropriate product suite (e.g., common configurations) to offer to customers and then would like technical guidance as they build an online configuration tool into their website and sales materials\n\nDomain knowledge of data center configurations and powering assemblies (e.g., Powerwhips, PDU cables) and the components that go into them is important for this role",
    "location": "",
    "time_posted": "32 seconds",
    "status": "New Project",
    "detected_at": "2026-01-07 20:30:29"
  },
  {
    "id": "rp45dg",
    "title": "Competitive War Gaming & Commercial Strategy: Global Renal Denervation (RDN) Market",
    "categories": [
      "Market Research",
      "General Market Research",
      "Competitive Analysis"
    ],
    "description": "Industry: Medical Technology / Medical Devices\n\nCorporate Strategy / Market Intelligence\n\nA leading global medical technology company is seeking a strategic consultant to facilitate a \"War Gaming\" exercise for its Renal Denervation (RDN) portfolio. While the client is currently the global market leader in this space, new market entrants and evolving clinical landscapes necessitate a proactive assessment of competitive threats in the US and key international markets.\n\nThe client currently holds a leadership position in revenue and brand perception across 80+ countries. However, the market is approaching a pivot point due to new reimbursement approvals and upcoming US entries from major competitors. Competitive pressure is specifically intensifying around technical modalities, procedure efficiency, and depth of ablation.\n\nThe client is looking for a vendor with specific experience facilitating cross-functional \"war gaming\" exercises. The goal is to:\n\n\nAssess the evolving competitive landscape across the US, Western Europe, China, and Japan.\n\nSimulate competitor movements and pressure-test current commercial strategies.\n\nAlign internal cross-functional stakeholders on a comprehensive response to market challenges.\n\n\nA PowerPoint summary capturing the outputs of the group exercises.\n\nA compiled list of actionable recommendations and commercial strategies based on the workshop findings.\n\nTimeline & Logistics\n\nTarget kickoff in February\n\nRemote with a global view preferred (US, Western Europe, China, and Japan).",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-07 22:26:50"
  },
  {
    "id": "x42mmq",
    "title": "Technology Transformation Program Manager for PE-backed SaaS company",
    "categories": [
      "Digital Transformation & Technology",
      "Technology Assessment & Implementation",
      "Technology Implementation Project Management"
    ],
    "description": "***NOTE TO CANDIDATES: As part of your pitch, please copy/paste the “Ideal Candidate” bullets and briefly reply with your relevant qualifications for each one.",
    "location": "",
    "time_posted": "35 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 18:40:35"
  },
  {
    "id": "y82pp2",
    "title": "Senior Financial Modeling Expert (Excel Research Lab - Remote)",
    "categories": [
      "Finance & Accounting",
      "Finance",
      "Financial Modeling"
    ],
    "description": "Problem Statement:\nWe are an AI for Excel research lab, currently operating in stealth mode, with a focus on enhancing the capabilities of Large Language Models (LLMs) in complex financial modeling. A pivotal aspect of our project is acquiring high-quality, professional-grade financial modeling data. While we've utilized various freelance platforms, we've found a need for a higher level of talent to maintain data input quality that matches premier institutional standards.\n\n\nThe objective is to have experts develop superior, technically robust financial models that will serve as essential data for LLM training. The project's success will be gauged by the precision and accuracy of the Excel models and the consultants' proficiency in navigating complex financial scenarios without compromising quality.\n\n\n- **Model Creation**: Develop comprehensive, professional-standard financial models within Excel.\n- **Quality Assurance**: Ensure that all models are logically coherent and \"auditor-ready\" for research objectives.\n- **Output-Based Delivery**: Begin with an hourly engagement model, with a transition towards an output/deliverable-based payment model for consistent, high-performing experts.\n\n\nWe seek individuals with exceptional qualifications, characterized by the following:\n- **Investment Banking Experience**: At least 2 years within an Investment Banking firm.\n- **Private Equity Experience**: An additional 1–2 years of experience within Private Equity.\n- **Excel Proficiency**: Must have extensive, recent experience in financial modeling and be considered an \"Excel beast.\"\n- **Alternative Backgrounds**: Open to senior experts (20+ years) who have maintained hands-on financial modeling expertise throughout their careers.\n- Note: General FP&A experience does not typically meet the specific technical modeling requirements we seek.\n\n\n- **Duration**: Immediate start, with the budget expanding to support a significant scale-up in hiring.\n- **Volume**: Anticipating onboarding 10 to 30+ individuals as the project scales.\n- **Location**: 100% Remote; our focus is on North American financial professionals, though we welcome exceptional global talent (EMEA/APAC).",
    "location": "",
    "time_posted": "38 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 18:40:35"
  }
]