[
  {
    "id": "y4qk7m",
    "title": "Data Driven Transformation of Global Pro Services Co",
    "categories": [
      "Data & Business Analytics",
      "Big Data & Analytics",
      "Data Science & Analysis"
    ],
    "description": "A global leader in technology talent services is undergoing a transformation in which it needs to transform its data infrastructure, systems, and operations to be more strategically aligned to customers. Think of the shift from being a reactive vendor who services talent needs to a proactive market-maker who seeks out its most strategic partners. \n\nThey are seeking an experienced data strategist and architect to support a ~3 month engagement focused on data discovery across ~100K job requisitions and 1 million+ talent profiles and helping to devise a \"talent exchange\" that provides dynamic data for leaders to steer the business. \n\n\nConduct data discovery and cleaning to classify both talent and demand at scale.\nHelp design and validate a standardized scoring rubric to evaluate opportunities based on multiple factors.\nDefine a common data language that enables clearer understanding of workforce supply/demand dynamics.\nSupport the development of a data-driven recommendation engine that pulls live information (e.g., via Salesforce CRM).\nConfirm and refine the current draft architecture (already ~85% complete) and advise on polishing it into a scalable, always-on system.\n\nData Discovery & Cleaning: Assess existing job and talent data, identify leakage, and prepare it for AI-driven classification.\nArchitecture & Rules Development: Build frameworks to classify demand and talent, set scoring rules, and define data inputs/outputs.\nRecommendation Engine Validation: Vet the design of the recommendation system, including its data architecture and specificity requirements.\n\nDeep experience ins.\nSkilled at identifying relationships between complex datasets \nStrong familiarity with BI and visualization tools (Looker preferred; Tableau/Power BI also relevant).\nComfortable with Salesforce data integrations.\nBackground in consulting or advanced data strategy roles preferred (prior MBB experience preferred, though not required).\nAdvanced beyond spreadsheet-level analysis; has handled large-scale, high-complexity datasets.\n\nStart date: ASAP\nDuration: Approx. 3 months (potential for extension).\nStructure: Deliverable-based / fixed cost (not hourly)\nRemote role",
    "location": "$80,000",
    "time_posted": "19 minutes",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "rdnvw6",
    "title": "Strategic IT Integration Lead: Global vs. Regional Operating Model (International Sportswear Retail)",
    "categories": [
      "Corporate Strategy",
      "Mergers & Acquisitions",
      "Post-Merger Integration"
    ],
    "description": "Project Overview:\nWe are seeking an expert IT M&A Strategy Consultant to lead the development of a technology integration framework following a high-profile, of a major US-based athletic footwear and fashion retailer by a leading .\nThe goal of this engagement is to define a clear . You will determine which parts of the technology stack should be centralized under the global parent’s infrastructure (e.g., Global Order Management, ERP) and which should remain regional or entity-specific to maintain the US brand's \"best-in-class\" local performance. You will serve as a strategic advisor to the , providing the framework and \"hand-holding\" necessary to navigate this transatlantic integration.\n\n\nDevelop the decision-making matrix to categorize IT services and systems into Global, Regional, or Local \"buckets.\"\nEvaluate the newly acquired US entity’s \"best-in-class\" e-commerce and omnichannel platforms against the global parent’s existing ecosystem to identify synergies, redundancies, or retention needs.\nCreate a roadmap for aligning US technical operations with the parent company's global standards without disrupting the brand's local market advantage.\nBridge communications between the UK corporate headquarters and the US-based leadership team to ensure technical alignment and cultural buy-in.\n\nDeep experience in high-volume retail, specifically in the sectors, where omnichannel and inventory velocity are critical.\nProven track record of leading IT integrations for large-scale acquisitions (ideally involving UK and US entities).\nSkilled in design and application rationalization.\nExperience advising C-suite leaders (CTOs/CIOs) through complex, urgent transformations.",
    "location": "",
    "time_posted": "18 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "xp4dpg",
    "title": "Public Relations Consultant for Sustainable Infrastructure Company",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Public Relations Strategy"
    ],
    "description": "Overview:\nWe're a global leader in sustainable infrastructure that is looking for a strategic PR consultant to lead the strategic communications for a major acquisition. \n\nWe need a though partner who understands the nuances of the Digital Out-of-Home (DOOH) and Ad-Tech landscape to position our newly expanded network as the most innovated, data-driven player in North America.\n\n\nAd-Tech Specialist: Deep experience in digital advertising, DOOH, or media technology.\nMedia Access: Existing, active relationships with editors at Adweek, AdAge, The Drum, Digiday, and other tier-one trades.\nProven Results: A track record of securing earned media for brands in the advertising space within the last 12 months.\nStrategic Vision: Ability to act as a consultant—not just a publicist—to craft a \"Phase 2\" narrative that positions the brand as a data-driven innovator.",
    "location": "",
    "time_posted": "21 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "xe9kem",
    "title": "Director, Digital Marketing & Integration Leader",
    "categories": [
      "Sales & Marketing",
      "Digital Marketing",
      "Digital Marketing Project Management"
    ],
    "description": "Overview:\nWe are seeking a strategic and results-driven Sr. Principal of Digital Marketing & Integration Leade to lead the integration and harmonization of our digital marketing practices across the enterprise. This role is pivotal in shaping our overall digital presence, driving customer engagement, and ensuring a seamless brand and operational integration across diverse platforms, teams, and processes.\n\nThe Digital Marketing and Integration Leader will be responsible for helping to shape the future of the digital experience for our global organization. They will be tasked with analyzing, planning, and executing on high-impact, cross-functional initiatives that will transform our primary web properties and other key digital touchpoints.\nThe ideal candidate will be someone who thrives in ambiguity and possesses the high-level expertise required to operate independently within a complex corporate environment.\n\n\nDevelop and execute a comprehensive digital marketing integration strategy aligned with business goals and customer needs.\nLead digital campaigns integration across web, email, SEO/SEM, social media, and paid media to drive awareness, engagement, and conversion.\nCollaborate with product marketing, sales, and scientific teams to ensure consistent messaging and positioning.\nManage initiative level digital marketing budget and agency/vendor relationships.\nServe as the marketing lead for the integration of two companies, ensuring alignment of digital assets, brand identity, and customer experience.\nDevelop and manage integration plans for digital platforms, including websites, CRM systems, marketing automation, and analytics tools.\nPartner with cross-functional teams (IT, HR, Sales, Legal, etc.) to ensure smooth operational and cultural integration.\nLead change management and communication strategies to support internal and external stakeholders.\nBuild and mentor a high-performing digital marketing team.\nSet clear goals, KPIs, and performance metrics for team members and campaigns.\n\nBachelor’s degree in Marketing, Communications, or related field; MBA or advanced degree preferred.\n10+ years of experience in digital marketing, with at least 5 years in a leadership role.\nProven experience in managing digital transformation or integration projects, ideally in the life sciences or healthcare industry.\nStrong understanding of digital marketing tools, platforms, and analytics.\nExcellent leadership, communication, and project management skills.\nAbility to thrive in a fast-paced, dynamic environment with multiple stakeholders.",
    "location": "Boston, MA, USA",
    "time_posted": "22 hours",
    "status": "New Project",
    "detected_at": "2026-01-06 14:21:09"
  },
  {
    "id": "x3wvjq",
    "title": "Sr. Consultant for Diligence in Towers and Wireless Industry",
    "categories": [
      "Market Research",
      "General Market Research",
      "General Market Research Expertise"
    ],
    "description": "**In your pitch** Please copy and paste the Ideal Candidate bullets to respond with your specific experiences, providing specific examples of previous diligence you have worked on\n\nWe are a consulting firm that is looking for a senior consultant to assist our team on a Towers and Wireless diligence projects. Prior experience with market overview, market analysis, business plan assessment, market forecasts. Strong excel and communication skills desired.\n\nThis specific project will last 4 weeks and will start as soon as possible.\n\nWhile this is one project, we typically have multiple similar diligence engagements that we are also looking for Data Center, Fiber, Towers, and general TMT experience.\n\n\nFormer Management Consultant with Diligence experience\nExperience with TMT Industry\nExperience with Towers and/or Wireless",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-06 23:37:00"
  },
  {
    "id": "xq48mb",
    "title": "Engineered wire harness data center product strategy",
    "categories": [
      "Digital Transformation & Technology",
      "Digital Strategy & Transformation",
      "Product Management"
    ],
    "description": "A custom fabricator of wire harness assemblies is looking to break into the data center market through the electrical contractor channel.  They would like to collect intelligence on the appropriate product suite (e.g., common configurations) to offer to customers and then would like technical guidance as they build an online configuration tool into their website and sales materials\n\nDomain knowledge of data center configurations and powering assemblies (e.g., Powerwhips, PDU cables) and the components that go into them is important for this role",
    "location": "",
    "time_posted": "32 seconds",
    "status": "New Project",
    "detected_at": "2026-01-07 20:30:29"
  },
  {
    "id": "rp45dg",
    "title": "Competitive War Gaming & Commercial Strategy: Global Renal Denervation (RDN) Market",
    "categories": [
      "Market Research",
      "General Market Research",
      "Competitive Analysis"
    ],
    "description": "Industry: Medical Technology / Medical Devices\n\nCorporate Strategy / Market Intelligence\n\nA leading global medical technology company is seeking a strategic consultant to facilitate a \"War Gaming\" exercise for its Renal Denervation (RDN) portfolio. While the client is currently the global market leader in this space, new market entrants and evolving clinical landscapes necessitate a proactive assessment of competitive threats in the US and key international markets.\n\nThe client currently holds a leadership position in revenue and brand perception across 80+ countries. However, the market is approaching a pivot point due to new reimbursement approvals and upcoming US entries from major competitors. Competitive pressure is specifically intensifying around technical modalities, procedure efficiency, and depth of ablation.\n\nThe client is looking for a vendor with specific experience facilitating cross-functional \"war gaming\" exercises. The goal is to:\n\n\nAssess the evolving competitive landscape across the US, Western Europe, China, and Japan.\n\nSimulate competitor movements and pressure-test current commercial strategies.\n\nAlign internal cross-functional stakeholders on a comprehensive response to market challenges.\n\n\nA PowerPoint summary capturing the outputs of the group exercises.\n\nA compiled list of actionable recommendations and commercial strategies based on the workshop findings.\n\nTimeline & Logistics\n\nTarget kickoff in February\n\nRemote with a global view preferred (US, Western Europe, China, and Japan).",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-07 22:26:50"
  },
  {
    "id": "x42mmq",
    "title": "Technology Transformation Program Manager for PE-backed SaaS company",
    "categories": [
      "Digital Transformation & Technology",
      "Technology Assessment & Implementation",
      "Technology Implementation Project Management"
    ],
    "description": "***NOTE TO CANDIDATES: As part of your pitch, please copy/paste the “Ideal Candidate” bullets and briefly reply with your relevant qualifications for each one.",
    "location": "",
    "time_posted": "35 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 18:40:35"
  },
  {
    "id": "y82pp2",
    "title": "Senior Financial Modeling Expert (Excel Research Lab - Remote)",
    "categories": [
      "Finance & Accounting",
      "Finance",
      "Financial Modeling"
    ],
    "description": "Problem Statement:\nWe are an AI for Excel research lab, currently operating in stealth mode, with a focus on enhancing the capabilities of Large Language Models (LLMs) in complex financial modeling. A pivotal aspect of our project is acquiring high-quality, professional-grade financial modeling data. While we've utilized various freelance platforms, we've found a need for a higher level of talent to maintain data input quality that matches premier institutional standards.\n\n\nThe objective is to have experts develop superior, technically robust financial models that will serve as essential data for LLM training. The project's success will be gauged by the precision and accuracy of the Excel models and the consultants' proficiency in navigating complex financial scenarios without compromising quality.\n\n\n- **Model Creation**: Develop comprehensive, professional-standard financial models within Excel.\n- **Quality Assurance**: Ensure that all models are logically coherent and \"auditor-ready\" for research objectives.\n- **Output-Based Delivery**: Begin with an hourly engagement model, with a transition towards an output/deliverable-based payment model for consistent, high-performing experts.\n\n\nWe seek individuals with exceptional qualifications, characterized by the following:\n- **Investment Banking Experience**: At least 2 years within an Investment Banking firm.\n- **Private Equity Experience**: An additional 1–2 years of experience within Private Equity.\n- **Excel Proficiency**: Must have extensive, recent experience in financial modeling and be considered an \"Excel beast.\"\n- **Alternative Backgrounds**: Open to senior experts (20+ years) who have maintained hands-on financial modeling expertise throughout their careers.\n- Note: General FP&A experience does not typically meet the specific technical modeling requirements we seek.\n\n\n- **Duration**: Immediate start, with the budget expanding to support a significant scale-up in hiring.\n- **Volume**: Anticipating onboarding 10 to 30+ individuals as the project scales.\n- **Location**: 100% Remote; our focus is on North American financial professionals, though we welcome exceptional global talent (EMEA/APAC).",
    "location": "",
    "time_posted": "38 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 18:40:35"
  },
  {
    "id": "y92kk7",
    "title": "Portfolio Reputation Monitoring & Strategy",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Public Relations Strategy"
    ],
    "description": "A large cap PE firm is seeking a consultant or small team to develop a scalable solution for internal reputation management and online monitoring across its portfolio. While the firm has PR resources, they currently lack a centralized way to monitor the portfolio at scale and identify where to focus intervention efforts. \n\n\n Establish a system to monitor online reviews, comments (e.g., Reddit, Google), and general sentiment across multiple portfolio companies simultaneously.\n Move beyond basic \"data scraping\" to provide competitive benchmarking—analyzing how portfolio companies stack up against competitors in the digital landscape.\n Identify and prioritize \"red flag\" reputational issues that could potentially \"tank a sale\" or decrease valuation during a divestiture process.\n Provide a clear framework for the firm to know exactly which portfolio companies require reputation support and when.\n\n Proven experience managing online reviews and brand sentiment at scale (not just at a single-company level).\n Ability to translate raw data into strategic insights for PE operating partners (the \"where to focus\").\n Knowledge of sentiment analysis and monitoring tools, but with a focus on high-level strategy rather than just technical development.\n\n\nWhen submitting a pitch, please include any relevant case studies in Private Equity environments.",
    "location": "",
    "time_posted": "11 minutes",
    "status": "New Project",
    "detected_at": "2026-01-09 21:33:24"
  },
  {
    "id": "y42mmn",
    "title": "Former Operator for Warehouse Operations & Embellishment Assessment",
    "categories": [
      "Operations & Supply Chain Management",
      "Operations & Process Improvement",
      "General Operations Expertise"
    ],
    "description": "***NOTE TO CANDIDATES: As part of your pitch, please copy/paste the “Ideal Candidate” bullets and briefly reply with your relevant qualifications for each one.\n\nWe're a privately held Professional Services & Distribution company, currently generating $60M in annual revenue and specializing in uniforms and promotional products. Following a leadership transition and a period of significant growth, we are looking to scale our operational infrastructure.\n\nWe have recently purchased a 100,000 sq. ft. warehouse in Ohio and are preparing for a critical move and consolidation in March. As we transition away from leased space and upgrade our Warehouse Management System (WMS), we have identified a need for a professional, third-party assessment of our current operational processes. We are currently relying heavily on internal legacy reporting and seek a \"True North\" perspective on what \"great\" looks like for a mid-market distribution and services organization of our complexity.\n\nThe primary objective of this engagement is to perform a 360-degree audit of our Ohio operations—specifically focusing on team dynamics, throughput optimization, technology utilization, and the integration of our \"embellishment\" (embroidery/customization) services—to ensure we are optimized for headcount costs and scalability.\n\n\nConduct a 3–4 day deep-dive assessment at our Ohio warehouse, interviewing the Director of Operations and auditing functional teams (Shipping, Picking, Packing, and Embellishment).\nAnalyze current workflows, throughput metrics, and reporting structures to identify bottlenecks and areas where legacy processes are failing to meet current complexity.\nEvaluate how current tools and the impending WMS upgrade are being utilized to optimize headcount and operational efficiency.\nAssess the specialized embroidery/customization function within the warehouse to ensure it is seamlessly integrated with standard receiving and fulfillment operations.\nProvide a comprehensive recap that validates current effective practices and identifies specific \"blind spots\" or areas for improvement.\nDevelop a \"True North\" proposal outlining the necessary steps for operational excellence as we move into the new facility in March/April.\nFacilitate feedback sessions with the SVP & GM, VP of Operations, and HR leadership to align on findings and organizational health.\n\nYou have a \"been there, done that\" background, specifically having managed or led warehouse operations in a mid-market distribution environment.\nProven experience with distribution organizations that include a \"services\" or \"customization\" component (e.g., embroidery, embellishments, or light manufacturing).\nUnderstanding of the tools and processes appropriate for a $50M–$200M company.\nExperience evaluating or implementing Warehouse Management Systems to drive headcount optimization and data-driven decision-making.\nAbility to quickly assess team dynamics and operational health through on-site interviews and observational analysis.\nAbility to translate complex operational findings into a clear, high-level strategic roadmap for executive leadership.",
    "location": "Columbus, OH, United States",
    "time_posted": "6 minutes",
    "status": "New Project",
    "detected_at": "2026-01-12 22:16:00"
  },
  {
    "id": "ywmjj5",
    "title": "Cybersecurity Framework Mapping & Gap Analysis (AICPA Membership Required)",
    "categories": [
      "Digital Transformation & Technology",
      "Technology Assessment & Implementation",
      "Technology Assessment"
    ],
    "description": "Project Overview\nWe are seeking a consultant with an active AICPA membership to perform a comparative analysis and control mapping across several major cybersecurity frameworks. This project requires someone who has performed cybersecurity audits in the past and can provide firsthand context on the level of effort and \"test time\" associated with various controls.\n\n\nFramework Analysis: Summarize the specific controls and processes required to achieve SOC 2, ISO 27001, FedRAMP, and PCI DSS v4.01.\nOverlap Mapping: Identify duplicative controls across these frameworks to determine where work in one area satisfies requirements in another.\nData Access: Utilize AICPA membership to access specific mapping tools and datasets currently behind paywalls that the client cannot access internally.\nOperational Context: Beyond a paper mapping, provide insights into the practical \"audit\" experience—specifically how long these tests typically take to perform and how cybersecurity stacks are reviewed in practice.\n\nCredentials: Active AICPA member (required) with prior experience certifying clients or performing audits against the listed frameworks.\nTechnical Knowledge: Strong understanding of cybersecurity stacks and control environments.\nLevel of Effort: This is estimated to be a quick-turnaround engagement (2–3 days of work) and is suitable for a junior-to-mid-level associate, provided they have the necessary membership and audit experience.\n\nTiming: ASAP start with a 2–3 day turnaround.",
    "location": "$10,000",
    "time_posted": "8 minutes",
    "status": "New Project",
    "detected_at": "2026-01-13 16:39:11"
  },
  {
    "id": "xg6n39",
    "title": "Voice of Customer (VOC) Process Review & Strategy",
    "categories": [
      "Market Research",
      "General Market Research",
      "Market Research Project Management"
    ],
    "description": "Overview:\nA global electronics manufacturer is looking for a consultant to review and enhance its Voice of Customer (VOC) processes as the company undergoes a major transition and integration. The goal is to ensure robust, scalable methods for gathering, analyzing, and acting on customer feedback across products, processes, and services.\nHistorically, VOC efforts included an annual Net Promoter Score (NPS) survey, a targeted customer service survey (administered by a third party and focused on purchasing teams), and a real-time “happy faces” feedback tool. While current indicators show high satisfaction levels, engagement is limited to a small subset of customers, creating a need for more comprehensive, representative input.\nWe'd like a holistic view/approach for this project, so we envision dividing it into 2 phases:\n Assess the current VOC state, identify gaps, share best practices, and develop a future-state strategy and implementation plan.\n Support the execution of the recommended approach, ensuring processes are effective and scalable globally.\n\n\nIndustrial/B2B experience, ideally in the electronics or materials industry.\nStrong understanding of industry standards and best practices when it comes to NPS, customer service, VOC surveys, etc.\nProven experience designing and implementing VOC programs globally.\nBased in North America, some travel to the Philadelphia are may be required.\n\n\nRelevant experience in VOC process design, implementation, and optimization.\nExperience within the electronics or electronic manufacturing sector.\nGlobal experience.",
    "location": "",
    "time_posted": "10 minutes",
    "status": "New Project",
    "detected_at": "2026-01-13 21:53:00"
  },
  {
    "id": "rm4jzv",
    "title": "PMO Diagnostic & Standardization/Training",
    "categories": [
      "Operations & Supply Chain Management",
      "Operations & Process Improvement",
      "Operations Project Management"
    ],
    "description": "We are a PE-backed Industrial Automation and Systems Integration company that provides full-stack automation capabilities—from the physical layer (robotics, vision, and electrical installation) through PLC controls, SCADA, and MES—serving customers across Life Sciences, Food & Beverage, CPG, Chemicals, and other discrete and process industries.\n\nWe have been growing rapidly through add-on acquisitions. In the last year we've acquired 4 new businesses that are now operating as BU under our corporate platform. \n\nIn each of these BUs there is a variance of project management maturity and capabilities, and we're now at the size and growth rate that we would like to formalize a PMO and bring the various PMs across these BU to a level of standardization and competency. \n\nWe're looking for a consultant that has had extensive experience setting up and managing PMOs in a project-based industry. Because our companies are working on complex project, there's an added layer of complexity to setting up and establishing best practices for the function. \n\nKey Responsibilities/Goals of the Engagement: Current state maturity diagnostic (by BU and at platform level) across people, process, systems.\nStandardized project language, key definitions, and core lifecycle (opportunity → URS /estimate → proposal / contract → hand‑off → execution → change control → EAC / financials → close‑out / lessons learned).\nRecommended future-state roles/org, processes, and tool stack (incl. what is BU-specific vs. shared vs. platform-level).\nPhased implementation roadmap and resource plan.",
    "location": "Chicago, IL, USA",
    "time_posted": "13 minutes",
    "status": "New Project",
    "detected_at": "2026-01-13 22:31:25"
  },
  {
    "id": "xvmwb6",
    "title": "Patient Engagement Platform Advisory Support",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Go-to-Market Strategy"
    ],
    "description": "Our client is a leading patient engagement platform that facilitates high-volume online bookings, virtual visits, and digital patient check-ins. As they enter a new phase of growth, they are seeking a Senior Advisor to support the leadership team in evolving their commercial model, and launching a new product line. \n\nThis is a (3-month minimum) intended for a subject matter expert who has successfully navigated the transition from a specialized healthcare tool to a broader, diversified marketplace or platform. The advisor will serve as a strategic partner to leadership, ensuring that the new product and commercial direction are grounded in proven industry playbooks.\n\n\nThe ideal candidate is a specialist with firsthand experience at a high-growth healthcare marketplace during a pivotal shift in their business model.\n\n\nExperience Bonus: Strong preference for candidates who were present during Zocdoc's specific period of commercial model evolution (e.g., the shift to sponsored listings or paid discovery). \nFunctional Expertise: A proven track record in GTM, Operations, Commercial Strategy, or Sales Leadership.\nStrategic Advisory: The ability to offer \"been-there-done-that\" insights into the operational challenges of scaling a healthcare-specific marketplace product.\n\n3-month minimum commitment.\nSemi-permanent advisory role.\nScope, time commitment, and specific deliverables will be defined based on the consultant’s unique skillset and seniority.",
    "location": "$10,000",
    "time_posted": "49 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 03:07:24"
  },
  {
    "id": "r5288j",
    "title": "Pricing Strategy for PE-Backed Aerospace Company",
    "categories": [
      "Market Research",
      "General Market Research",
      "Pricing Analysis & Optimization"
    ],
    "description": "We are a PE firm with a portfolio company in the aerospace industry. This company sells and operationalizes engine upgrades, but also does upgrades, maintenance, and repairs for turbo prop single and multi engine planes. We are looking for a consultant to help us understand the pricing strategy around the alternatives on these engine upgrades and refurbishments, ultimately helping us improve our margins. \n\nThis consultant would have direct experience working with pricing strategy in the Aerospace industry, whether that was working at a firm or as a pricing operator at a large Aerospace company (United Technologies, Honeywell, etc.). They will need domain expertise related to engines and engine components. \n\nThis project will be a 4-6 week diagnostic with the potential to extend beyond to support the implementation phase. We are looking to kick off the project as soon as we identify the right consultant.",
    "location": "",
    "time_posted": "29 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 18:53:55"
  },
  {
    "id": "yp45kn",
    "title": "Operating Model & Margin Optimization (B2B Tech-Enabled Services)",
    "categories": [
      "Operations & Supply Chain Management",
      "Operations & Process Improvement",
      "General Operations Expertise"
    ],
    "description": "We are a PE firm that invests into lower-middle-market B2B SaaS companies. Our portfolio company provides learning and compliance management software for accounting firms. The L&D segment of the business operates on a \"subscription access to expertise\" model, where their large enterprise clients receive high-end expertise and staff augmentation and “L&D in a box” solution for smaller firms. The current operating model is immature, so the goal is to stabilize a disciplined operating model that optimizes internal capacity and maximizes gross margin as the business scales.\n\nThe consultant will conduct a deep-dive diagnostic of the internal workings of the service delivery model. This is not a vendor spend rationalization or a pure pricing exercise; rather, it is an operational assessment focused on how the team delivers value to increase gross margins.\n\nWe are looking to kick this work off as soon as possible with a critical checkpoint in mid-to-late February/March. The final, detailed roadmap and implementation plan are expected by the April/May timeframe.\n\n\nAnalyzing current state gross margin by customer and identifying specific levers for improvement.\nEvaluating team utilization and identifying opportunities to leverage lower-cost resources for specific activities.\nRefining the organizational structure and standardized operating rhythms to support an expertise augmentation managed services model.\n: Delivering a detailed plan to capture margin points through better resource leveling and process efficiency.\n\n\nFormer COO, VP of Ops, or CFO for Services Businesses\nExperience with Organizational Design \nCost Optimization through internal process design, resource allocation, and organizational scaling",
    "location": "",
    "time_posted": "15 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 21:19:18"
  },
  {
    "id": "ym4j5v",
    "title": "Brand Licensing Consultant (NFL)",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Brand Strategy"
    ],
    "description": "We are a PE-backed consumer goods business that recently had a very successful year after gaining licensing rights for NCAA teams on our products. Based on this success, we're hoping to break into the NFL brand licensing space as well. \n\nWe're looking for someone that has experience and can help our team get the right approvals and negotiate with the NFL brand licensing.",
    "location": "",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-14 22:00:16"
  },
  {
    "id": "xbpqde",
    "title": "Marketing Operations & Tactical Execution Lead",
    "categories": [
      "Sales & Marketing",
      "Digital Marketing",
      "General Digital Marketing Expertise"
    ],
    "description": "We are seeking a highly organized, tactically-focused Marketing Operations Consultant to provide execution-level support across a portfolio of pharmaceutical assets.\n\nThe buyer oversees a team of 8 Directors who are currently over-leveraged with \"manager-level\" administrative tasks. The goal of this engagement is to offload the \"blocking and tackling\" of marketing operations, allowing the senior leadership team to refocus on high-level brand strategy.\nThe ideal candidate is not a strategist, but a  who thrives in project management, budget tracking, and navigating complex internal systems.\n\nKey Responsibilities\nThe consultant will support the team across three primary \"buckets\":\n\n1. \nEnd-to-end management of marketing POs.\nRigorous budget tracking and consistent follow-up to ensure financial accuracy across multiple products.\n\n2. \nManaging the upload and maintenance of marketing resources within a new Resource Management Portal.\nHandling administrative workflows within  and SharePoint to ensure field teams have access to the latest approved materials.\n\n3. \nExecuting administrative requirements for Non-Personal Promotion (NPP) tactics (e.g., email blasts, GPO programs, speaker programs, and ad boards).\nManaging vendor coordination, speaker logistics, and paperwork to ensure timelines are met and tactics actually deploy.\n\nRequired Experience & Profile\n•  This is NOT a strategic role. We are looking for a candidate who is \"hands-on\" and comfortable with high-volume administrative execution.\n•  Prior experience with any of the below systems is a significant advantage. Specifically:\n\n\n\n•  Must understand the regulatory and compliance landscape of pharmaceutical marketing.\n•  Exceptional project management, time management, and budget oversight.\n•  Manager/Senior Manager level experience (or an independent consultant who specializes in \"tactical\" rather than \"advisory\" work).",
    "location": "",
    "time_posted": "13 minutes",
    "status": "New Project",
    "detected_at": "2026-01-20 22:41:29"
  },
  {
    "id": "yjbk13",
    "title": "Media Optimization Support for Pharmaceutical Company",
    "categories": [
      "Data & Business Analytics",
      "Big Data & Analytics",
      "Business Impact Analysis"
    ],
    "description": "The Media Measurement Optimization & Web Analytics team within a large pharmaceutical organization is looking to backfill a manager level resource while a team member is out on leave for at at least 3 months. This resource would be focusing on translating complex media and site analytics into actionable insights to improve marketing ROI across the company's Primary Care and Oncology brands. The consultant will work closely with internal teams and media agencies (paid media) to implement the new measurement framework, optimize cross-channel strategies, and support data-driven decision-making.\n\nThis individual should be comfortable taking on Omni channel and HCP Media focused initiatives.",
    "location": "",
    "time_posted": "12 minutes",
    "status": "New Project",
    "detected_at": "2026-01-22 17:04:45"
  },
  {
    "id": "rbpqke",
    "title": "Salesforce Architect Lead Developer for a PE-Backed B2B Services Company",
    "categories": [
      "Digital Transformation & Technology",
      "Technology Assessment & Implementation",
      "General Technology Expertise"
    ],
    "description": "We are a ~400m PE-backed full-service amenities service provider specializing in multifamily housing. The company performs several recurring services on a long-term contract basis. For context, we've seen consistent growth in our first 15 years, where we were operating in an entrepreneurial manner and growing rapidly while operating heavily on tribal knowledge. We have been going through an end-to-end alignment initiative of reconfiguring and redefining our end to end process (for example aligning what we sell with what we put into contract with what we deliver and what we bill). \n\nWe are now working on operationalizing these changes in Salesforce. We have internal Salesforce admins, developers and an integration team, that is stretched for bandwidth so we're looking for a Salesforce architect lead developer to support our team. \n\nWe need this person to support on the following activities:\nLook at how we manage products and pricing and advise on how to implement this in SFDC\nSupport SFDC integration with embedded lifecycle management tools (Conga)\nSupport mobilization efforts to make it easily accessible for clients / users\nQualifications:\nSalesforce experience in B2B services space\nCan support on Salesforce strategy and implementation\nSalesforce integration with contract lifecycle management tools\nChange management experience",
    "location": "",
    "time_posted": "9 minutes",
    "status": "New Project",
    "detected_at": "2026-01-22 19:32:31"
  },
  {
    "id": "y82p8j",
    "title": "Salesforce dashboard builder / analytics support for PE-backed company",
    "categories": [
      "Data & Business Analytics",
      "Big Data & Analytics",
      "Data Visualization"
    ],
    "description": "Project description:\n\n***NOTE TO CANDIDATES: As part of your pitch, please copy/paste the “Ideal Candidate” bullets and briefly reply with your relevant qualifications for each one. A PE-backed company is seeking a salesforce dashboard building / analytics support. The Consultant would be working directly with the finance team, including the Director of FP&A and Chief Revenue Officer to build monthly reports\n\n\n\nDeep experience building reports and dashboards in salesforce - they need to be able to hit the ground running\nExperience in building data visualizations in Salesforce and Tableau\nExperience working with FP&A teams is a plus",
    "location": "",
    "time_posted": "39 seconds",
    "status": "New Project",
    "detected_at": "2026-01-23 15:13:44"
  },
  {
    "id": "r72wqm",
    "title": "Liquid Cooling Market Analysis",
    "categories": [
      "Market Research",
      "General Market Research",
      "Market Landscape"
    ],
    "description": "Problem Statement:\nOur organization is seeking a more detailed understanding of the liquid cooling equipment market, comprising critical components such as Coolant Distribution Units (CDUs), racks, manifolds, and cold plates. The detail we're seeking needs to be highly granular and specific, as we already have a broader understanding of these dynamics.\n\n\nSuccess for this project will be a comprehensive understanding of the liquid cooling equipment market landscape. This includes detailed insights into original equipment manufacturers (OEMs), current market volumes, existing install bases, and future projections categorized by size and quantity. Armed with this information, our organization will be equipped to strategically plan and position ourselves in the market effectively.\n\n\nThe project scope includes an in-depth market analysis of the liquid cooling equipment sector, specifically focusing on CDUs, racks, manifolds, and cold plates. Deliverables will include a detailed report containing:\n\n- A list of key OEMs and their market shares.\n- Current market volumes and the existing install base.\n- Projections of market growth by size and quantity for the next 5 years.\n- Competitive landscape analysis, highlighting major competitors and market dynamics.\n\n\nThe ideal consultant will possess extensive experience in the data center or IT infrastructure industries, specifically within cooling technologies. Familiarity with mechanical or thermal engineering concepts related to liquid cooling systems is preferred. Additionally, proven capabilities in developing market forecasts and competitive analysis are essential.",
    "location": "",
    "time_posted": "14 minutes",
    "status": "New Project",
    "detected_at": "2026-01-23 15:58:34"
  },
  {
    "id": "xbpq66",
    "title": "Former CRO for PE-Backed Software Company",
    "categories": [
      "Sales & Marketing",
      "Sales",
      "General Sales Expertise"
    ],
    "description": "We are a consulting firm working on an active operational transformation engagement at a PE-backed software company (~1B in revenue). We have built trust with this client through our active engagement and have identified a growth opportunity on the commercial side. We are trying to upsell our client on this opportunity and are looking for support in that.\n\nWe are looking for someone with the following criteria to help sell this opportunity to the current CRO.\nHas held a CRO role (or has deep sales operations experience) at a software company in the 0.5 - 3B in revenue range\nExperience selling\nHas significant accountability for sales growth\nConsulting experience\nStrong EQ\nIf we win the work, this consultant will be brought on to support the execution. \nWe see this type of opportunity across our clients so there is also appetite for this person to play a similar role with our other clients.",
    "location": "",
    "time_posted": "43 minutes",
    "status": "New Project",
    "detected_at": "2026-01-23 21:45:03"
  },
  {
    "id": "xq481d",
    "title": "Consultant to support with Power BI reporting and dashboard development",
    "categories": [
      "Data & Business Analytics",
      "Big Data & Analytics",
      "Data Visualization"
    ],
    "description": "We are a PE-backed healthcare company looking to bring in support on reporting and dashboard development, with a focus on Power BI and our data stack.\nIdeal candidate:\n\nStrong Power BI experience (building executive friendly dashboards, measures, and data models)\nStrong Snowflake experience (data modeling and working with warehouse based reporting pipelines)\nIdeally, familiarity with Athena and healthcare data is a plus\nBonus if the person can also help think through integrating additional source systems beyond Athena over time (for example payroll and other sub ledgers)",
    "location": "",
    "time_posted": "10 minutes",
    "status": "New Project",
    "detected_at": "2026-01-26 19:35:45"
  },
  {
    "id": "ydnzj7",
    "title": "Salesforce Marketing Cloud Strategy & Technical Product Manager (Wealth Management)",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Marketing Strategy Project Management"
    ],
    "description": "As part of your pitch, please copy/paste the “Ideal Candidate” bullets for the role that is a fit and briefly reply with your relevant qualifications for each one.\n\nA PE-backed wealth management firm is seeking a senior-level consultant to serve as the strategic bridge between business leadership and technical execution for a large-scale Salesforce Marketing Cloud deployment. Following a rollout to ~950 independent advisors, the firm needs a specialist who can translate high-level marketing goals into technical roadmaps while providing credible strategic guidance to executive stakeholders.\n\n\n Serve as a subject matter expert to the SVP of Marketing, advising on the effective use of Marketing Cloud to achieve growth, advisor recruitment, and adoption goals.\n Lead the \"Business-to-Tech\" briefing process, translating \"fuzzy\" & unformed business needs into concrete technical requirements, data segmentation logic, and journey entry/exit criteria for the development team.\n Design a comprehensive Marketing Cloud strategy and roadmap, identifying high-impact use cases and establishing repeatable templates for future journeys.\n Provide direction to junior technical resources responsible for \"hands-on-keyboard\" journey building; this role focuses on  to build and  to scale rather than day-to-day execution\n\n\n Deep experience in Salesforce Marketing Cloud strategy, infrastructure, and Journey Builder.\n Significant experience in financial services or wealth management is highly preferred to credibly advise on industry-specific nuances and advisor-franchisee relationship models.\n Proven ability to communicate effectively with both non-technical business leaders and highly technical developers.\n 10+ years of professional experience, with a track record of leading MarTech transformations in complex, regulated environments.",
    "location": "",
    "time_posted": "19 minutes",
    "status": "New Project",
    "detected_at": "2026-01-26 20:50:55"
  },
  {
    "id": "xvmwz6",
    "title": "Senior Commercial Transformation Lead - B2B Sales Optimization - Microsoft ProServices Firm",
    "categories": [
      "Sales & Marketing",
      "Sales",
      "Sales Team Optimization"
    ],
    "description": "Problem Statement: We are a Microsoft technology consulting firm positioned for aggressive growth ($8M to $30M in 24 months), but our commercial maturity lags behind our delivery capability. We have successfully developed a proprietary, high-value methodology (\"SPEAR\") and have the internal tactical capacity to execute changes (CRM, Ops, Marketing). However, we lack the to transition our Go-to-Market motion from a \"person-dependent\" consultancy to a scalable \"productized risk\" engine. We have structural breaks in our sales logic, specifically in pricing strategy, organizational design (\"Pods\"), and the commercial narrative required to sell complex risk mitigation to the C-Suite. We need a high-level expert to design the commercial architecture that our team will build.\n\nA validated, executive-grade Commercial Transformation Roadmap that bridges the gap between our current state and the $30M target. Success is defined by the delivery of a Commercial Architecture that:\n\nTransforming our internal \"Battle Cards\" into a market-facing commercial strategy that forces C-level engagement.\n\nA stress-tested organizational design (Engagement Lead + Practice Principal) that solves for velocity and scale, replacing our current friction-heavy handoffs.\n\nA unified consensus among the CEO, CSO, and CMO on the exact \"Rules of Engagement\" required to scale, ensuring leadership stops \"saving\" deals and starts managing the system.\n\nThis is a engagement working directly with the C-Suite. The Expert is responsible for , while the internal team handles .\n\n\nConduct a \"Voice of the Customer\" and internal audit to diagnose exactly our velocity stalls, identifying the strategic disconnects between Sales, Delivery, and Finance.\n\nDesign the complete \"Pod\" operating model, defining the high-level Roles, Responsibilities, and economic incentives (Compensation Strategy) for the future \"Hunter\" roles.\n\nAdvise on the pricing structure and packaging of the \"L3 Diagnostic\" to ensure it functions as a high-velocity market wedge (Risk Insurance), rather than low-value consulting.\n\nShadow key leadership meetings and provide high-level coaching to the C-Suite on enforcing the new standards (e.g., \"How to run a forecast call without accepting fluff\").\n\nDeliver the financial model and headcount \"ramp plan\" required to hit the 2-year target, identifying the exact \"Trigger Points\" for hiring.\n\n\nCRM configuration, field mapping, or data entry.\nTactical pipeline scrubbing or day-to-day deal management.\nMarketing collateral creation (graphic design/copywriting).\n\n\nA comprehensive document outlining the \"New Way of Selling,\" including the finalized Operating Model, Pricing Architecture, and Rules of Engagement.\n\nA guide for leadership on how to manage the new engine (KPIs, Meeting Cadence, Coaching Frameworks).\n\nA strategic assessment of current personnel and process vs. the $30M requirement.\n\n\nFormer Partner or Principal at a top-tier strategy firm (McKinsey, Bain, BCG, or Big 4 Strategy), or a former Chief Revenue Officer (CRO) of a professional services firm that scaled past $50M.\n\n\nProven ability to design sales organizations, not just manage them.\nDeep understanding of the interplay between Utilization, Bookings, and Margin in a consulting environment.\nExperience advising C-level executives on navigating cultural shifts during high-growth periods.\nMust demonstrate the ability to stay at the \"30,000-foot level\" and direct the internal team on execution, rather than getting lost in the weeds.",
    "location": "",
    "time_posted": "33 minutes",
    "status": "New Project",
    "detected_at": "2026-01-27 14:55:06"
  },
  {
    "id": "y62w3p",
    "title": "Graphic Design & Copywriting – Women & Wealth Study (Phase 2)",
    "categories": [
      "Market Research",
      "General Market Research",
      "General Market Research Expertise"
    ],
    "description": "Project Overview: We are seeking a graphic designer and copywriter pair to support the marketing strategy and content development for the second phase of a data-driven \"Women & Wealth\" study. The study explores the financial behaviors, preferences, and unmet needs of high-earning women executives, with a target of over 10,000 respondents.\n\n\nDesign and copy for a comprehensive report based on the study's findings.\nA high-impact presentation deck for sharing insights with industry stakeholders.\nAdapting insights for differentiated offerings and thought leadership positioning across advisory and fintech circles.\n\nProven track record of producing best-in-class reports for top-tier firms (e.g., McKinsey, BCG, EY) or notable publications like the .\nAbility to translate complex data into compelling narratives and visually engaging designs.\n\nExpected within the next 1–2 weeks.\nTargeting first two weeks of February \nPhase 2 will commence immediately upon onboarding as data becomes available.",
    "location": "",
    "time_posted": "38 minutes",
    "status": "New Project",
    "detected_at": "2026-01-27 20:00:40"
  },
  {
    "id": "rbpqz6",
    "title": "Growth Strategy for Semiconductor AI Business Unit",
    "categories": [
      "Sales & Marketing",
      "Marketing Strategy",
      "Go-to-Market Strategy"
    ],
    "description": "We are seeking a high-caliber Strategic Consultant & Operator to architect and execute our North American expansion. This is not an advisory role; we need a hands-on leader who has successfully scaled semiconductor AI businesses and can bridge the gap between high-level strategy and tactical market entry.\n\n Define our go-to-market (GTM) strategy to secure tier-one contracts with industry leaders and establish a permanent regional footprint.\nResolve sales bottlenecks by identifying and qualifying high-probability leads. You will lead both organic lead generation and the identification of strategic M&A targets to fast-track our technical capabilities.\nPosition our product as an end-to-end partner for , integrating hardware design, AI-led engineering, and specialized testing infrastructure.\nProvide expert \"operator-level\" guidance\n\nDirector experience in the semiconductor AI space, preferably operator experience. \nDeep experience in growth strategy and M&A, with the ability to navigate complex high-value negotiations.\nDirect experience within the Aerospace & Defense sector, including knowledge of compliance and specialized procurement cycles, is a bonus.",
    "location": "",
    "time_posted": "7 minutes",
    "status": "New Project",
    "detected_at": "2026-01-27 20:50:16"
  },
  {
    "id": "r3wv4w",
    "title": "B2B Marketing Executive for PE-Backed Software Company",
    "categories": [
      "Corporate Strategy",
      "Interim Executives",
      "Interim Executive - Marketing"
    ],
    "description": "We are a consulting firm working on an active comprehensive transformation program of all functions at a PE-backed B2B software company (~300m revenue). Our goal is to enhance operational efficiency/ scalability. We're going fucntion by funciotn making recommendations on workflow improvements, tool improvements, AI implementation, org restructuring initiatives.  \nWe are looking for a SME in marketing in a B2B software environment to lead this initiative in the marketing function. \n\nKey Elements of Workstream:\nDeveloping a best cost location strategy for the marketing function\nTools / enablement recommendations to drive efficiency / effectiveness of marketing spend\nDevelop a framework of the best way to make use of agencies / data they purchased\nDefine go-forward marketing operating model\nThrough this, they should develop specific recommendations for the CMO and be a co-owner with the CMO to drive these initiatives.\n\nMarketing org structure:\nProduct marketing\nMarketing operations\nDigital marketing\nIndustry marketing\nThis will need to be someone with in the space. Ideally this person also has experience working at companies, around .",
    "location": "Chicago, IL, United States",
    "time_posted": "3 minutes",
    "status": "New Project",
    "detected_at": "2026-01-27 21:51:02"
  },
  {
    "id": "x42mqe",
    "title": "Business Process Analysis/Architect",
    "categories": [
      "Data & Business Analytics",
      "Big Data & Analytics",
      "Business Impact Analysis"
    ],
    "description": "Overview:\nWe are looking for a Business Process Architect (BPA) to support a critical service transformation initiative. The primary focus of this engagement is to bridge the gap between business discovery and technical architecture. You will join our upcoming workshops with the Service teams to capture, synthesize, and translate complex operational discussions into professional, scalable process diagrams.\n\nThe ideal consultant will have a deep understanding of the Technical Support and Field Service lifecycles and the ability to operate effectively within the CRM ecosystem.\n\n\n\nAttend and facilitate technical discovery sessions with our Service stakeholders (starting mid-March).\nTranslate verbal requirements and \"as-is\" descriptions into detailed, high-fidelity process map.\nEnsure all diagrams align with industry best practices for service operations and CRM integration.\n:\n\nProven track record in Technical Support and Field Serviceworkflows (e.g., case management, dispatch, onsite service, parts logistics).\nMastery of process mapping tools and familiarity with CRM architecture\nAbility to \"read between the lines\" during workshops to identify process gaps or inefficiencies.",
    "location": "",
    "time_posted": "5 minutes",
    "status": "New Project",
    "detected_at": "2026-01-27 21:58:38"
  }
]